In [106]:
import pandas as pd
import numpy as np

In [107]:
df=pd.read_csv("dirty_cafe_sales.csv")

In [108]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [109]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_9226047,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [111]:
df['Price Per Unit']=pd.to_numeric(df['Price Per Unit'],errors='coerce').round().astype('Int64')

In [112]:
df['Price Per Unit'].isna().sum()

np.int64(533)

In [113]:
df['Price Per Unit'].isnull().sum()

np.int64(533)

In [114]:
df['Price Per Unit']=df['Price Per Unit'].fillna(round(df['Price Per Unit'].mean()))

In [115]:
df.sample(10)

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
585,TXN_1353479,Smoothie,4,4,16.0,Cash,NaN,2023-09-20
9447,TXN_1946773,Sandwich,4,4,16.0,Cash,NaN,2023-08-28
5991,TXN_2913107,UNKNOWN,4,3,8.0,NaN,In-store,2023-05-20
6706,TXN_5236861,Coffee,4,2,8.0,Cash,Takeaway,2023-10-27
9079,TXN_1891217,Tea,5,2,7.5,NaN,NaN,2023-04-02
7733,TXN_2107161,Cookie,4,1,4.0,Credit Card,NaN,UNKNOWN
7505,TXN_6881662,Salad,2,5,10.0,Digital Wallet,Takeaway,2023-07-10
3478,TXN_3228558,Sandwich,2,4,8.0,Credit Card,NaN,2023-12-13
8425,TXN_1983422,Cookie,2,1,2.0,Digital Wallet,In-store,2023-06-26
2410,TXN_3720223,Cake,4,3,12.0,Cash,Takeaway,2023-10-22

In [116]:
df['Quantity']=pd.to_numeric(df['Quantity'],errors='coerce').round().astype('Int64')

In [117]:
df['Quantity'].isnull().sum()

np.int64(479)

In [118]:
df['Total Spent']=pd.to_numeric(df['Total Spent'],errors='coerce').round().astype('Int64')

In [119]:
df['Total Spent']=df['Total Spent'].fillna(round(df['Quantity']*df['Price Per Unit']))

In [120]:
null_rows = df[df['Total Spent'].isnull()]
print(null_rows)

     Transaction ID      Item  Quantity  Price Per Unit  Total Spent  \
236     TXN_8562645     Salad      <NA>               5         <NA>
278     TXN_3229409     Juice      <NA>               3         <NA>
641     TXN_2962976     Juice      <NA>               3         <NA>
738     TXN_8696094  Sandwich      <NA>               4         <NA>
2796    TXN_9188692      Cake      <NA>               3         <NA>
3203    TXN_4565754  Smoothie      <NA>               4         <NA>
3224    TXN_6297232    Coffee      <NA>               2         <NA>
3401    TXN_3251829       Tea      <NA>               2         <NA>
4257    TXN_6470865    Coffee      <NA>               2         <NA>
5841    TXN_5884081    Cookie      <NA>               1         <NA>
7029    TXN_4628338    Coffee      <NA>               2         <NA>
7297    TXN_9944500  Smoothie      <NA>               4         <NA>
8021    TXN_2428781     Salad      <NA>               5         <NA>
8443    TXN_2023651  Sandwich      <NA>               4         <NA>
8465    TXN_9669616    Coffee      <NA>               2         <NA>
8479    TXN_1547245  Sandwich      <NA>               4         <NA>
8574    TXN_2546684     Juice      <NA>               3         <NA>
8732    TXN_4550558    Cookie      <NA>               1         <NA>
9590    TXN_9924732  Sandwich      <NA>               4         <NA>
9869    TXN_1975184    Coffee      <NA>               2         <NA>

      Payment Method  Location Transaction Date
236              NaN  In-store       2023-05-18
278             Cash  Takeaway       2023-04-15
641              NaN       NaN       2023-03-17
738              NaN  Takeaway       2023-05-14
2796     Credit Card       NaN       2023-12-01
3203  Digital Wallet  Takeaway       2023-10-06
3224             NaN       NaN       2023-04-07
3401  Digital Wallet  In-store       2023-07-25
4257  Digital Wallet  Takeaway       2023-09-18
5841  Digital Wallet  In-store       2023-07-05
7029            Cash       NaN       2023-12-25
7297            Cash  In-store       2023-01-03
8021             NaN  In-store       2023-05-09
8443            Cash  In-store       2023-05-25
8465             NaN     ERROR       2023-06-03
8479             NaN  Takeaway       2023-09-11
8574  Digital Wallet  Takeaway       2023-04-08
8732     Credit Card  In-store       2023-08-04
9590     Credit Card  In-store       2023-01-18
9869  Digital Wallet       NaN       2023-01-15

In [121]:
df['Quantity']=df['Quantity'].fillna(round(df['Total Spent']//df['Price Per Unit']))

In [122]:
print(df[df['Quantity'].isna()])

     Transaction ID      Item  Quantity  Price Per Unit  Total Spent  \
236     TXN_8562645     Salad      <NA>               5         <NA>
278     TXN_3229409     Juice      <NA>               3         <NA>
641     TXN_2962976     Juice      <NA>               3         <NA>
738     TXN_8696094  Sandwich      <NA>               4         <NA>
2796    TXN_9188692      Cake      <NA>               3         <NA>
3203    TXN_4565754  Smoothie      <NA>               4         <NA>
3224    TXN_6297232    Coffee      <NA>               2         <NA>
3401    TXN_3251829       Tea      <NA>               2         <NA>
4257    TXN_6470865    Coffee      <NA>               2         <NA>
5841    TXN_5884081    Cookie      <NA>               1         <NA>
7029    TXN_4628338    Coffee      <NA>               2         <NA>
7297    TXN_9944500  Smoothie      <NA>               4         <NA>
8021    TXN_2428781     Salad      <NA>               5         <NA>
8443    TXN_2023651  Sandwich      <NA>               4         <NA>
8465    TXN_9669616    Coffee      <NA>               2         <NA>
8479    TXN_1547245  Sandwich      <NA>               4         <NA>
8574    TXN_2546684     Juice      <NA>               3         <NA>
8732    TXN_4550558    Cookie      <NA>               1         <NA>
9590    TXN_9924732  Sandwich      <NA>               4         <NA>
9869    TXN_1975184    Coffee      <NA>               2         <NA>

      Payment Method  Location Transaction Date
236              NaN  In-store       2023-05-18
278             Cash  Takeaway       2023-04-15
641              NaN       NaN       2023-03-17
738              NaN  Takeaway       2023-05-14
2796     Credit Card       NaN       2023-12-01
3203  Digital Wallet  Takeaway       2023-10-06
3224             NaN       NaN       2023-04-07
3401  Digital Wallet  In-store       2023-07-25
4257  Digital Wallet  Takeaway       2023-09-18
5841  Digital Wallet  In-store       2023-07-05
7029            Cash       NaN       2023-12-25
7297            Cash  In-store       2023-01-03
8021             NaN  In-store       2023-05-09
8443            Cash  In-store       2023-05-25
8465             NaN     ERROR       2023-06-03
8479             NaN  Takeaway       2023-09-11
8574  Digital Wallet  Takeaway       2023-04-08
8732     Credit Card  In-store       2023-08-04
9590     Credit Card  In-store       2023-01-18
9869  Digital Wallet       NaN       2023-01-15

In [123]:
df['Quantity'].mean()

np.float64(3.0203406813627254)

In [124]:
df['Quantity']=df['Quantity'].fillna(round(df['Quantity'].mean()))

In [125]:
df['Total Spent']=df['Total Spent'].fillna(round(df['Quantity']*df['Price Per Unit']))

In [126]:
df.sample(10)

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
2177,TXN_4650044,Cookie,4,1,4,Cash,NaN,2023-06-21
5556,TXN_9382596,Smoothie,5,4,20,Credit Card,Takeaway,2023-11-18
7928,TXN_7308629,Salad,4,5,20,ERROR,Takeaway,2023-11-24
2994,TXN_3375399,Cookie,1,1,1,Digital Wallet,Takeaway,2023-05-21
100,TXN_9517146,NaN,5,5,25,Cash,Takeaway,2023-10-30
1335,TXN_7033977,Sandwich,4,4,16,NaN,Takeaway,2023-05-04
243,TXN_4530804,Coffee,4,2,8,NaN,NaN,2023-01-12
4834,TXN_1285279,Coffee,2,2,4,Cash,Takeaway,2023-04-09
2735,TXN_5822344,Sandwich,5,4,20,Cash,In-store,2023-09-27
2427,TXN_5947976,Coffee,3,2,6,NaN,In-store,2023-05-21

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          10000 non-null  Int64
 3   Price Per Unit    10000 non-null  Int64
 4   Total Spent       10000 non-null  Int64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: Int64(3), object(5)
memory usage: 654.4+ KB

In [128]:
df['Transaction Date']=pd.to_datetime(df['Transaction Date'],errors='coerce')

In [129]:
df['Transaction Date'].isnull().sum()

np.int64(460)

In [130]:
df=df.sort_values(by='Transaction Date', ascending=True)
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
8015,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
9063,TXN_9161256,Smoothie,2,4,8,Digital Wallet,In-store,2023-01-01
7309,TXN_6093955,Tea,5,2,10,UNKNOWN,Takeaway,2023-01-01
1425,TXN_8842223,Sandwich,5,3,20,Digital Wallet,In-store,2023-01-01
1777,TXN_7367474,Juice,5,3,15,Digital Wallet,Takeaway,2023-01-01

In [131]:
df = df.reset_index(drop=True)

In [132]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_9161256,Smoothie,2,4,8,Digital Wallet,In-store,2023-01-01
2,TXN_6093955,Tea,5,2,10,UNKNOWN,Takeaway,2023-01-01
3,TXN_8842223,Sandwich,5,3,20,Digital Wallet,In-store,2023-01-01
4,TXN_7367474,Juice,5,3,15,Digital Wallet,Takeaway,2023-01-01

In [133]:
df['Transaction Date']=df['Transaction Date'].fillna(df['Transaction Date'].mean())

In [134]:
df['Transaction Date'].isnull().sum()

np.int64(0)

In [135]:
df['Transaction Date']=df['Transaction Date'].dt.date

In [136]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_9161256,Smoothie,2,4,8,Digital Wallet,In-store,2023-01-01
2,TXN_6093955,Tea,5,2,10,UNKNOWN,Takeaway,2023-01-01
3,TXN_8842223,Sandwich,5,3,20,Digital Wallet,In-store,2023-01-01
4,TXN_7367474,Juice,5,3,15,Digital Wallet,Takeaway,2023-01-01

In [137]:
df=df.sort_values(by='Transaction Date', ascending=True)

In [138]:
df['Location'].unique()

array(['Takeaway', 'ERROR', 'In-store', nan, 'UNKNOWN'], dtype=object)

In [139]:
df['Location']=df['Location'].replace(['ERROR','UNKNOWN'],np.nan)

In [140]:
df['Location'].unique()

array(['Takeaway', nan, 'In-store'], dtype=object)

In [141]:

df['Location']=df['Location'].fillna(df['Location'].mode()[0])

In [142]:
df['Location'].unique()

array(['Takeaway', 'In-store'], dtype=object)

In [143]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
19,TXN_6234882,Cookie,4,1,4,Credit Card,Takeaway,2023-01-01
18,TXN_1581562,Coffee,2,2,4,Cash,In-store,2023-01-01
17,TXN_4292280,Cake,4,3,12,Cash,Takeaway,2023-01-01
16,TXN_6566716,Coffee,1,2,2,Credit Card,Takeaway,2023-01-01

In [144]:
df['Payment Method'].unique()

array(['Digital Wallet', 'Credit Card', 'Cash', 'ERROR', nan, 'UNKNOWN'],
      dtype=object)

In [145]:
df['Payment Method']=df['Payment Method'].replace(['ERROR','UNKNOWN'],np.nan)

In [146]:
df['Payment Method'].isnull().sum()

np.int64(3178)

In [147]:
df['Payment Method'].value_counts()

Payment Method
Digital Wallet    2291
Credit Card       2273
Cash              2258
Name: count, dtype: int64

In [148]:
counts = df['Payment Method'].value_counts()
most = counts.index[0]
second = counts.index[1] if len(counts) > 1 else most
least = counts.index[-1]

# Probabilities: 50%, 30%, 20%
choices = [most, second, least]
probs = [0.5, 0.3, 0.2]

# Fill NaNs randomly according to probabilities
df.loc[df['Payment Method'].isna(), 'Payment Method'] = np.random.choice(choices, 
                                                             size=df['Payment Method'].isna().sum(),
                                                             p=probs)

In [149]:
df['Payment Method'].value_counts()

Payment Method
Digital Wallet    3853
Credit Card       3222
Cash              2925
Name: count, dtype: int64

In [150]:
df['Payment Method'].isnull().sum()

np.int64(0)

In [154]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_6234882,Cookie,4,1,4,Credit Card,Takeaway,2023-01-01
2,TXN_1581562,Coffee,2,2,4,Cash,In-store,2023-01-01
3,TXN_4292280,Cake,4,3,12,Cash,Takeaway,2023-01-01
4,TXN_6566716,Coffee,1,2,2,Credit Card,Takeaway,2023-01-01

In [155]:
df = df.reset_index(drop=True)

In [156]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_6234882,Cookie,4,1,4,Credit Card,Takeaway,2023-01-01
2,TXN_1581562,Coffee,2,2,4,Cash,In-store,2023-01-01
3,TXN_4292280,Cake,4,3,12,Cash,Takeaway,2023-01-01
4,TXN_6566716,Coffee,1,2,2,Credit Card,Takeaway,2023-01-01

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          10000 non-null  Int64
 3   Price Per Unit    10000 non-null  Int64
 4   Total Spent       10000 non-null  Int64
 5   Payment Method    10000 non-null  object
 6   Location          10000 non-null  object
 7   Transaction Date  10000 non-null  object
dtypes: Int64(3), object(5)
memory usage: 654.4+ KB

In [157]:
df['Item'].value_counts()

Item
Juice       1171
Coffee      1165
Salad       1148
Cake        1139
Sandwich    1131
Smoothie    1096
Cookie      1092
Tea         1089
UNKNOWN      344
ERROR        292
Name: count, dtype: int64

In [160]:
df['Item'].isnull().sum()

np.int64(969)

In [159]:
df['Item']=df['Item'].replace(['ERROR','UNKNOWN'],np.nan)

In [161]:
df['Item'].isnull().sum()

np.int64(969)

In [165]:
item_prices = df.groupby('Item')['Price Per Unit'].first()
print(item_prices)

Item
Cake        3
Coffee      2
Cookie      1
Juice       3
Salad       5
Sandwich    4
Smoothie    4
Tea         2
Name: Price Per Unit, dtype: Int64

In [164]:
# Your mapping of Item  Price Per Unit
price_mapping = {
    3: ['Cake', 'Juice'],
    2: ['Coffee', 'Tea'],
    1: ['Cookie'],
    5: ['Salad'],
    4: ['Sandwich', 'Smoothie']
}

# Function to fill missing Item based on Price Per Unit
def fill_item(row):
    if pd.isna(row['Item']):
        price = row['Price Per Unit']
        if price in price_mapping:
            # If multiple items share the same price, pick randomly
            return np.random.choice(price_mapping[price])
    return row['Item']

# Apply to DataFrame
df['Item'] = df.apply(fill_item, axis=1)

In [166]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_6234882,Cookie,4,1,4,Credit Card,Takeaway,2023-01-01
2,TXN_1581562,Coffee,2,2,4,Cash,In-store,2023-01-01
3,TXN_4292280,Cake,4,3,12,Cash,Takeaway,2023-01-01
4,TXN_6566716,Coffee,1,2,2,Credit Card,Takeaway,2023-01-01

In [167]:
df.sample(10)

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
4723,TXN_7827797,Salad,3,5,15,Credit Card,Takeaway,2023-06-30
3753,TXN_5817991,Smoothie,4,4,16,Cash,Takeaway,2023-05-24
528,TXN_6383336,Cake,2,3,6,Cash,Takeaway,2023-01-21
8114,TXN_7435096,Coffee,4,2,6,Digital Wallet,In-store,2023-10-21
8579,TXN_9629256,Cake,4,3,12,Digital Wallet,In-store,2023-11-07
1552,TXN_2480488,Juice,2,3,6,Cash,Takeaway,2023-03-01
2245,TXN_5731238,Cake,2,3,6,Credit Card,Takeaway,2023-03-27
3849,TXN_8786479,Coffee,4,2,8,Cash,Takeaway,2023-05-29
6372,TXN_9677376,Smoothie,4,4,16,Digital Wallet,In-store,2023-08-15
1574,TXN_8892230,Coffee,5,2,10,Digital Wallet,Takeaway,2023-03-02

In [168]:
df['Total Spent']=df['Quantity']*df['Price Per Unit']

In [170]:
df.sample(10)

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
6135,TXN_2291713,Salad,4,5,20,Cash,In-store,2023-08-06
4893,TXN_5761073,Cookie,1,1,1,Cash,In-store,2023-07-01
1916,TXN_9201010,Salad,1,5,5,Credit Card,Takeaway,2023-03-15
4269,TXN_4108120,Coffee,2,2,4,Digital Wallet,In-store,2023-06-14
4537,TXN_2851147,Salad,2,5,10,Digital Wallet,In-store,2023-06-24
2594,TXN_5087453,Tea,3,2,6,Cash,Takeaway,2023-04-09
7166,TXN_3893927,Salad,4,5,20,Credit Card,In-store,2023-09-14
3162,TXN_6670371,Tea,3,2,6,Credit Card,Takeaway,2023-05-01
9269,TXN_8932070,Smoothie,3,4,12,Digital Wallet,In-store,2023-12-03
4734,TXN_2119373,Salad,4,5,20,Credit Card,In-store,2023-06-30

In [171]:
df.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_4801947,Juice,1,3,3,Digital Wallet,Takeaway,2023-01-01
1,TXN_6234882,Cookie,4,1,4,Credit Card,Takeaway,2023-01-01
2,TXN_1581562,Coffee,2,2,4,Cash,In-store,2023-01-01
3,TXN_4292280,Cake,4,3,12,Cash,Takeaway,2023-01-01
4,TXN_6566716,Coffee,1,2,2,Credit Card,Takeaway,2023-01-01

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              10000 non-null  object
 2   Quantity          10000 non-null  Int64
 3   Price Per Unit    10000 non-null  Int64
 4   Total Spent       10000 non-null  Int64
 5   Payment Method    10000 non-null  object
 6   Location          10000 non-null  object
 7   Transaction Date  10000 non-null  object
dtypes: Int64(3), object(5)
memory usage: 654.4+ KB

In [173]:
df.to_csv('cafe_sales.csv',index=False)